{
   "Biome Pyramid": {
     "Description": "The 'Biome Pyramid' illustrates how temperature and moisture influence the distribution of Earth's biomes. At the base, warm and wet conditions near the equator support tropical rainforests. As moisture decreases, these transition into savannas and then deserts. Moving upward, temperate regions exhibit forests in wetter areas and grasslands in drier zones. Near the pyramid's peak, cold climates give rise to boreal forests (taiga), and at the top, the coldest and driest conditions are home to tundra biomes. This pyramid visually represents the relationship between climate factors and biome distribution.",
     "Source": "https://bigthink.com/strange-maps/a-pyramid-map-of-the-worlds-biomes/"
   },
   "Temperate Ecosystem": {
     "Description": "Temperate ecosystems are characterized by obvious seasonality in temperature, with cooler winters and warmer summers, and also may show distinct seasonality in precipitation patterns, resulting from seasonal changes in the orientation of Earth’s axis relative to the sun.",
     "Source": "https://www.sciencedirect.com/topics/earth-and-planetary-sciences/temperate-ecosystem"
   },
   "Types of Ecosystem - Part 1": {
     "Author": "Ralph Christian G. Sarzuela",
     "Degree": "BS CPE - 4B"
   },
   "Short Activity": {
     "Title": "Guess the Word!",
     "Numbers": ["1", "2", "3"]
   },
   "What is an Ecosystem?": {
     "Definition": "Comes from the Greek word 'Oikos' meaning home and 'systema' meaning system. It is a geographic area where plants, animals, and other organisms, as well as weather and landscapes, work together to form a bubble of life.",
     "Factors": {
       "Biotic": "Living factors",
       "Abiotic": "Nonliving factors"
     },
     "History": "The term 'Ecosystem' was first coined by Arthur George Tansley, an English botanist, in 1935.",
     "Source": "https://education.nationalgeographic.org/resource/ecosystem/"
   },
   "Types of Ecosystem": {
     "Definition": "An ecosystem can be as small as an oasis in a desert, or as big as an ocean, spanning thousands of miles.",
     "Categories": ["Terrestrial", "Aquatic"]
   },
   "Terrestrial Ecosystem": {
     "Definition": "A terrestrial ecosystem is a land-based community of organisms and the interactions of biotic and abiotic components in a given area.",
     "Coverage": "Terrestrial ecosystems cover approximately 140 to 150 million km², which is about 25 to 30 percent of the total earth surface area.",
     "Types": ["Temperate", "Tropical"],
     "Source": "https://byjus.com/biology/terrestrial-ecosystem/"
   }
 }
 {
  "slides": [
    {
      "title": "Forest Layers",
      "text": "A forest is just like a building with four floors or so-called \"layers\": forest floor, herbaceous layer, shrub layer, and tree layer.",
      "sections": [
        {
          "title": "Forest Floor (Directly to the ground)",
          "text": "The forest floor is covered with mosses, fungi, and foliage, providing food and shelter for insects, reptiles, and small mammals."
        },
        {
          "title": "Herbaceous Layer (up to 5 feet / 1.5 meters)",
          "text": "The herbaceous layer consists of grasses and ferns, offering food and protection for insects, with plant growth depending on sunlight availability and protection from ground predators."
        }
      ],
      "source": "https://www.animalfunfacts.net/knowledge/362-animals-of-the-forest.html"
    },
    {
      "title": "Forest Layers",
      "sections": [
        {
          "title": "Shrub Layer (up to 16 feet / 4.88 meters)",
          "text": "The shrub layer provides shelter for deer and birds, offering nesting spots and food, with thorny plants protecting birds from predators."
        },
        {
          "title": "Tree Layer (up to 16 feet / 5 meters)",
          "text": "The tree layer is home to birds and climbing mammals like squirrels, offering nesting sites and protection from ground predators."
        }
      ],
      "source": "https://www.animalfunfacts.net/knowledge/362-animals-of-the-forest.html"
    },
    {
      "title": "Grasslands",
      "text": "Grasslands are dominated by a nearly continuous cover of grasses. Grasslands occur in environments conducive to the growth of this plant cover but not to that of taller plants, particularly trees and shrubs.",
      "sections": [
        {
          "title": "Types of Grasslands",
          "text": "The two distinct types of grasslands are savannas and temperate grasslands. Temperate grasslands have moderate climates with hot summers and cold winters, featuring mostly grasses with few trees. Savannas are tropical grasslands with warm temperatures year-round, scattered trees, and seasonal rainfall."
        },
        {
          "title": "Human Impact",
          "text": "Humans have had a dramatic impact on the grassland biome. Because temperate grasslands have rich soil, most of the grasslands in the United States have been converted into fields for crops or grazing land for cattle. The loss of grasslands due to agriculture has affected several species, including monarch butterflies."
        },
        {
          "title": "Wildlife",
          "text": "Grasslands support herbivores like bison, antelope, water buffalo, and zebras, as well as predators such as lions and cheetahs."
        }
      ],
      "source": "https://www.britannica.com/science/grassland https://education.nationalgeographic.org/resource/grassland-biome/"
    },
    {
      "title": "Tundra",
      "text": "Tundra is the coldest of all the biomes. Tundra comes from the Finnish word 'tunturi', meaning 'treeless plain'. It is noted for its frost-molded landscapes, extremely low temperatures, little precipitation, poor nutrients, and short growing seasons.",
      "sections": [
        {
          "title": "Nutrients",
          "text": "Dead organic material functions as a nutrient pool. The two major nutrients are nitrogen and phosphorus. Nitrogen is created by biological fixation, and phosphorus is created by precipitation."
        },
        {
          "title": "Wildlife",
          "text": "The tundra hosts animals adapted to cold climates, including reindeer, Arctic foxes, brown bears, ermines, lemmings, partridges, snowy owls, and various insects."
        }
      ],
      "source": "https://ucmp.berkeley.edu/exhibits/biomes/tundra"
    },
    {
      "title": "Forest",
      "text": "A terrestrial environment dominated by trees growing in a closed canopy.",
      "sections": [
        {
          "title": "Ecological Role",
          "text": "The organisms involved in a forest ecosystem are interdependent on one another for survival and can be broadly classified according to their ecological role as producers, consumers, and decomposers."
        },
        {
          "title": "Wildlife",
          "text": "Forests are home to a diverse range of animals, including mammals like deer, bears, and squirrels; birds such as owls and woodpeckers; reptiles like snakes and lizards; and numerous insects."
        }
      ],
      "source": "https://adria-balkan.fsc.org/en/forest-ecosystems"
    }
  ]
}
{
   "ecosystems": [
     {
       "name": "Forest Layers",
       "description": "A forest is just like a building with four floors or so-called 'layers': forest floor, herbaceous layer, shrub layer, and tree layer.",
       "layers": [
         {
           "name": "Forest Floor",
           "description": "The forest floor is covered with mosses, fungi, and foliage, providing food and shelter for insects, reptiles, and small mammals."
         },
         {
           "name": "Herbaceous Layer",
           "description": "Consists of grasses and ferns, offering food and protection for insects. Plant growth depends on sunlight availability and protection from ground predators."
         },
         {
           "name": "Shrub Layer",
           "description": "Provides shelter for deer and birds, offering nesting spots and food. Thorny plants protect birds from predators."
         },
         {
           "name": "Tree Layer",
           "description": "Home to birds and climbing mammals like squirrels, offering nesting sites and protection from ground predators."
         }
       ],
       "source": "https://www.animalfunfacts.net/knowledge/362-animals-of-the-forest.html"
     },
     {
       "name": "Grasslands",
       "description": "Grasslands are dominated by a nearly continuous cover of grasses. These environments support plant cover but not taller trees and shrubs.",
       "types": [
         {
           "name": "Temperate Grasslands",
           "description": "Moderate climates with hot summers and cold winters, featuring mostly grasses with few trees."
         },
         {
           "name": "Savannas",
           "description": "Tropical grasslands with warm temperatures year-round, scattered trees, and seasonal rainfall."
         }
       ],
       "human_impact": "Most grasslands in the United States have been converted into fields for crops or grazing land, affecting species like monarch butterflies.",
       "animals": ["Bison", "Antelope", "Water Buffalo", "Zebras", "Lions", "Cheetahs"],
       "sources": [
         "https://www.britannica.com/science/grassland",
         "https://education.nationalgeographic.org/resource/grassland-biome/"
       ]
     },
     {
       "name": "Tundra",
       "description": "The coldest biome, derived from the Finnish word 'tunturi,' meaning treeless plain. Noted for frost-molded landscapes, low temperatures, little precipitation, poor nutrients, and short growing seasons.",
       "nutrients": ["Nitrogen", "Phosphorus"],
       "animals": ["Reindeer", "Arctic Fox", "Brown Bear", "Ermines", "Lemmings", "Snowy Owls"],
       "types": [
         {
           "name": "Alpine Tundra",
           "description": "Located on high-altitude mountains where trees cannot grow. Growing season lasts around 180 days."
         },
         {
           "name": "Arctic Tundra",
           "description": "Encircles the North Pole, extending to the taiga. Cold, desert-like conditions with winter temperatures averaging -34°C."
         }
       ],
       "source": "https://ucmp.berkeley.edu/exhibits/biomes/tundra"
     },
     {
       "name": "Taiga",
       "description": "The world's largest biome, stretching across Eurasia and North America below the tundra. Winters are long, cold, and snowy, while summers are short, warm, rainy, and humid.",
       "temperatures": {
         "winter": "-54°C to -1°C",
         "summer": "-7°C to 21°C"
       },
       "seasons": ["Winter", "Summer"],
       "animals": [
         "Martens", "Wolverines", "Lemmings", "Reindeer", "Moose", "Deer", "Lynxes",
         "Brown Bears", "Black Bears", "Foxes", "Hares", "Otters", "Beavers", "Skunks", "Chipmunks", "Squirrels"
       ],
       "source": "https://www.blueplanetbiomes.org/taiga.php"
     },
     {
       "name": "Temperate Forests",
       "description": "Temperate forests are located between 25 and 50 degrees latitude in both hemispheres, featuring a continuous canopy of broad-leaved trees.",
       "climate": "Four distinct seasons with moderate climates.",
       "vegetation": [
         "Deciduous trees like oak, beech, and maple",
         "Canopy trees: Maple, Walnut, Birch",
         "Small Trees: Dogwoods, Redbuds, Shadbush",
         "Shrubs: Azaleas, Mountain Laurel, Huckleberries",
         "Herbs: Blue Bead Lily, Indian Cucumber, Wild Sarsaparilla",
         "Ground Cover: Lichens and mosses"
       ],
       "animals": ["Deer", "Bears", "Squirrels", "Foxes", "Bird species"],
       "source": "https://www.treehugger.com/land-biomes-temperate-forests-373499"
     },
     {
       "name": "Tropical Forests",
       "description": "Dense, evergreen forests with high rainfall, supporting over half of the world's plant and animal species, covering 2-6% of the planet.",
       "major_rainforests": ["Amazon", "Congo", "Southeast Asia", "Australia", "Pacific Northwest"],
       "Philippines_species": ["Philippine Eagle", "Tarsier", "Crocodile"],
       "structure": {
         "layers": [
           {
             "name": "Emergent Layer",
             "description": "The highest layer, where tall trees rise above the canopy, home to birds, bats, and insects."
           },
           {
             "name": "Canopy Layer",
             "description": "A dense layer of overlapping tree branches that house most rainforest wildlife, including monkeys, sloths, and parrots."
           },
           {
             "name": "Understory Layer",
             "description": "A dimly lit area beneath the canopy, filled with shrubs, small trees, and animals like jaguars, snakes, and frogs."
           },
           {
             "name": "Forest Floor",
             "description": "The darkest layer, with decomposing plants, fungi, and animals like tigers, tapirs, and insects."
           }
         ]
       },
       "source": "https://education.nationalgeographic.org/resource/rain-forest/"
     },
     {
       "name": "Dry Forests",
       "description": "Make up nearly half of the world's tropical and subtropical forests, supporting millions through timber and non-timber products.",
       "threats": ["Population pressure", "Land demands", "Deforestation"],
       "Philippines_species": ["Visayan Warty Pig", "Philippine Forest Turtle"],
       "source": "https://www.cifor-icraf.org/publications/pdf_files/factsheet/4875-factsheet.pdf"
     }
   ]
 }
 
 {
   "biomes": [
     {
       "name": "Temperate Forest",
       "description": "Temperate forests can support a wide variety of plant life and vegetation due to abundant rainfall and thick soil humus. These forests exist in several layers, ranging from lichens and mosses to large tree species like oak and hickory.",
       "vegetation": {
         "forest_canopy_tier": ["Maple trees", "Walnut trees", "Birch trees"],
         "small_tree_tier": ["Dogwoods", "Redbuds", "Shadbush"],
         "shrub_tier": ["Azaleas", "Mountain laurel", "Huckleberries"],
         "herb_tier": ["Blue bead lily", "Indian cucumber", "Wild sarsaparilla"],
         "floor_tier": ["Lichens", "Mosses"]
       },
       "animals": ["Deer", "Bears", "Squirrels", "Foxes", "Various bird species"],
       "source": "https://www.treehugger.com/land-biomes-temperate-forests-373499"
     },
     {
       "name": "Tundra",
       "description": "The tundra is separated into Arctic Tundra and Alpine Tundra, characterized by cold conditions, permafrost, and a short growing season.",
       "types": {
         "Alpine Tundra": "Located on mountains at high altitudes where trees cannot grow. Growing season is approximately 180 days.",
         "Arctic Tundra": "Encircles the North Pole, extending to the taiga. Cold, desert-like conditions with annual precipitation of 15-25 cm."
       },
       "animals": ["Reindeer", "Arctic Fox", "Snowy Owl", "Brown Bear"],
       "source": "https://ucmp.berkeley.edu/exhibits/biomes/tundra"
     },
     {
       "name": "Taiga",
       "description": "The taiga, or boreal forest, is the world's largest biome, stretching across Eurasia and North America below the tundra. It has long, cold winters and short, warm summers with coniferous trees.",
       "animals": ["Martens", "Wolverines", "Lemmings", "Reindeer", "Moose", "Deer", "Lynxes", "Bears", "Foxes"],
       "source": "https://www.blueplanetbiomes.org/taiga.php"
     },
     {
       "name": "Tropical Forest",
       "description": "Tropical forests are dense, biodiverse forests found near the Equator with warm temperatures and high annual rainfall. They house over 50% of global plant and animal species.",
       "layers": {
         "Emergent Layer": "Tallest trees rise above the canopy, home to birds, bats, and insects.",
         "Canopy Layer": "Dense layer of overlapping branches that house most rainforest wildlife.",
         "Understory Layer": "Dimly lit area beneath the canopy with shrubs, small trees, and animals like jaguars, snakes, and frogs.",
         "Forest Floor": "Darkest layer with decomposing plants, fungi, and animals like tigers, tapirs, and insects."
       },
       "animals": ["Philippine Eagle", "Tarsier", "Crocodile"],
       "source": "https://education.nationalgeographic.org/resource/rain-forest"
     },
     {
       "name": "Dry Forest",
       "description": "Dry forests make up nearly half of the world's tropical and subtropical forests, supporting millions of people through timber and non-timber products. They face greater threats than humid forests due to population pressure.",
       "animals": ["Visayan Warty Pig", "Philippine Forest Turtle"],
       "importance": {
         "Food": "Wild fruits, vegetables, nuts, edible insects, and bushmeat provide essential nutrients.",
         "Fuel": "Wood is the primary energy source for households in dry forest areas.",
         "Livelihoods": "Products like beeswax, honey, and wood provide economic opportunities.",
         "Carbon Storage": "Helps mitigate climate change but stores less carbon than humid forests.",
         "Climate Adaptation": "Supports resilience to climate change and variability.",
         "Agriculture": "Provides ecosystem services like water management and soil improvement."
       },
       "source": "https://www.cifor-icraf.org/publications/pdf_files/factsheet/4875-factsheet.pdf"
     },
     {
       "name": "Savanna",
       "description": "Savannas are open tree canopies with scattered trees and a continuous tall grass understory, found in hot, seasonally dry climates.",
       "regions": ["Africa", "South America", "Australia", "India", "Myanmar", "Thailand", "Madagascar"],
       "animals": ["Elephants", "Giraffes", "Lions", "Cheetahs"],
       "source": "https://www.britannica.com/science/savanna"
     },
     {
       "name": "Desert",
       "description": "Deserts are large, extremely dry regions with sparse vegetation, found in both hot and cold climates. They cover about one-fifth of Earth's land area.",
       "types": {
         "Subtropical Deserts": "Found along the Tropics of Cancer and Capricorn (e.g., Sahara, Kalahari).",
         "Coastal Deserts": "Formed by cold ocean currents creating fog but little rainfall (e.g., Atacama Desert).",
         "Rain Shadow Deserts": "Located on the leeward side of mountains (e.g., Death Valley).",
         "Interior Deserts": "Found deep within continents where winds lose all moisture before reaching.",
         "Polar Deserts": "Cold regions with little precipitation, where water is trapped in ice (e.g., Antarctica)."
       },
       "animals": ["Fennec Fox", "Dromedary Camel", "Meerkat"],
       "source": "https://www.britannica.com/science/desert"
     }
   ]
 }
 